MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECH064/mcu.h
extern volatile __CFGPGbits_t CFGPGbits __asm__ ("CFGPG") __attribute__((section("sfrs"), address(0xBF8000E0)));
extern volatile uint32_t        CFGPGCLR __attribute__((section("sfrs"),address(0xBF8000E4)));
extern volatile uint32_t        CFGPGSET __attribute__((section("sfrs"),address(0xBF8000E8)));
extern volatile uint32_t        CFGPGINV __attribute__((section("sfrs"),address(0xBF8000EC)));
#define NVMCON NVMCON
extern volatile uint32_t   NVMCON __attribute__((section("sfrs"), address(0xBF800600)));
typedef union {
  struct {
    uint32_t NVMOP:4;
    uint32_t :3;
    uint32_t SWAP:1;
    uint32_t :4;
    uint32_t LVDERR:1;
    uint32_t WRERR:1;
    uint32_t WREN:1;
    uint32_t WR:1;
  };
  struct {
    uint32_t NVMOP0:1;
    uint32_t NVMOP1:1;
    uint32_t NVMOP2:1;
    uint32_t NVMOP3:1;
  };
  struct {
    uint32_t PROGOP:4;
  };
  struct {
    uint32_t PROGOP0:1;
    uint32_t PROGOP1:1;
    uint32_t PROGOP2:1;
    uint32_t PROGOP3:1;
  };
  struct {
    uint32_t w:32;
  };
} __NVMCONbits_t;
extern volatile __NVMCONbits_t NVMCONbits __asm__ ("NVMCON") __attribute__((section("sfrs"), address(0xBF800600)));
extern volatile uint32_t        NVMCONCLR __attribute__((section("sfrs"),address(0xBF800604)));
extern volatile uint32_t        NVMCONSET __attribute__((section("sfrs"),address(0xBF800608)));
extern volatile uint32_t        NVMCONINV __attribute__((section("sfrs"),address(0xBF80060C)));
#define NVMKEY NVMKEY
extern volatile uint32_t   NVMKEY __attribute__((section("sfrs"), address(0xBF800610)));
#define NVMADDR NVMADDR
extern volatile uint32_t   NVMADDR __attribute__((section("sfrs"), address(0xBF800620)));
extern volatile uint32_t        NVMADDRCLR __attribute__((section("sfrs"),address(0xBF800624)));
extern volatile uint32_t        NVMADDRSET __attribute__((section("sfrs"),address(0xBF800628)));
extern volatile uint32_t        NVMADDRINV __attribute__((section("sfrs"),address(0xBF80062C)));
#define NVMDATA0 NVMDATA0
extern volatile uint32_t   NVMDATA0 __attribute__((section("sfrs"), address(0xBF800630)));
#define NVMDATA1 NVMDATA1
extern volatile uint32_t   NVMDATA1 __attribute__((section("sfrs"), address(0xBF800640)));
#define NVMDATA2 NVMDATA2
extern volatile uint32_t   NVMDATA2 __attribute__((section("sfrs"), address(0xBF800650)));
#define NVMDATA3 NVMDATA3
extern volatile uint32_t   NVMDATA3 __attribute__((section("sfrs"), address(0xBF800660)));
#define NVMSRCADDR NVMSRCADDR
extern volatile uint32_t   NVMSRCADDR __attribute__((section("sfrs"), address(0xBF800670)));
#define NVMPWP NVMPWP
extern volatile uint32_t   NVMPWP __attribute__((section("sfrs"), address(0xBF800680)));
typedef struct {
  uint32_t PWP:24;
  uint32_t :7;
  uint32_t PWPULOCK:1;
} __NVMPWPbits_t;
extern volatile __NVMPWPbits_t NVMPWPbits __asm__ ("NVMPWP") __attribute__((section("sfrs"), address(0xBF800680)));
#define NVMBWP NVMBWP
extern volatile uint32_t   NVMBWP __attribute__((section("sfrs"), address(0xBF800690)));
typedef struct {
  uint32_t UBWP0:1;
  uint32_t UBWP1:1;
  uint32_t UBWP2:1;
  uint32_t UBWP3:1;
  uint32_t UBWP4:1;
  uint32_t :2;
  uint32_t UBWPULOCK:1;
  uint32_t LBWP0:1;
  uint32_t LBWP1:1;
  uint32_t LBWP2:1;
  uint32_t LBWP3:1;
  uint32_t LBWP4:1;
  uint32_t :2;
  uint32_t LBWPULOCK:1;
} __NVMBWPbits_t;
extern volatile __NVMBWPbits_t NVMBWPbits __asm__ ("NVMBWP") __attribute__((section("sfrs"), address(0xBF800690)));
extern volatile uint32_t        NVMBWPCLR __attribute__((section("sfrs"),address(0xBF800694)));
extern volatile uint32_t        NVMBWPSET __attribute__((section("sfrs"),address(0xBF800698)));
extern volatile uint32_t        NVMBWPINV __attribute__((section("sfrs"),address(0xBF80069C)));
#define WDTCON WDTCON
extern volatile uint32_t   WDTCON __attribute__((section("sfrs"), address(0xBF800800)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t WDTWINEN:1;
    uint32_t SWDTPS:5;
    uint32_t :8;
    uint32_t ON:1;
    uint32_t WDTCLRKEY:16;
  };
  struct {
    uint32_t :2;
    uint32_t SWDTPS0:1;
    uint32_t SWDTPS1:1;
    uint32_t SWDTPS2:1;
    uint32_t SWDTPS3:1;
    uint32_t SWDTPS4:1;
    uint32_t :9;
    uint32_t WDTCLRKEY0:1;
    uint32_t WDTCLRKEY1:1;
    uint32_t WDTCLRKEY2:1;
    uint32_t WDTCLRKEY3:1;
    uint32_t WDTCLRKEY4:1;
    uint32_t WDTCLRKEY5:1;
    uint32_t WDTCLRKEY6:1;
    uint32_t WDTCLRKEY7:1;
    uint32_t WDTCLRKEY8:1;
    uint32_t WDTCLRKEY9:1;
    uint32_t WDTCLRKEY10:1;
    uint32_t WDTCLRKEY11:1;
    uint32_t WDTCLRKEY12:1;
    uint32_t WDTCLRKEY13:1;
    uint32_t WDTCLRKEY14:1;
    uint32_t WDTCLRKEY15:1;
  };
  struct {
    uint32_t :2;
    uint32_t WDTPSTA:5;
  };
  struct {
    uint32_t :2;
    uint32_t WDTPS:5;
  };
  struct {
    uint32_t w:32;
  };
} __WDTCONbits_t;
extern volatile __WDTCONbits_t WDTCONbits __asm__ ("WDTCON") __attribute__((section("sfrs"), address(0xBF800800)));
extern volatile uint32_t        WDTCONCLR __attribute__((section("sfrs"),address(0xBF800804)));
extern volatile uint32_t        WDTCONSET __attribute__((section("sfrs"),address(0xBF800808)));
extern volatile uint32_t        WDTCONINV __attribute__((section("sfrs"),address(0xBF80080C)));
#define DMTCON DMTCON
extern volatile uint32_t   DMTCON __attribute__((section("sfrs"), address(0xBF800A00)));
typedef struct {
  uint32_t :15;
  uint32_t ON:1;
} __DMTCONbits_t;
extern volatile __DMTCONbits_t DMTCONbits __asm__ ("DMTCON") __attribute__((section("sfrs"), address(0xBF800A00)));
#define DMTPRECLR DMTPRECLR
extern volatile uint32_t   DMTPRECLR __attribute__((section("sfrs"), address(0xBF800A10)));
typedef struct {
  uint32_t :8;
  uint32_t STEP1:8;
} __DMTPRECLRbits_t;
extern volatile __DMTPRECLRbits_t DMTPRECLRbits __asm__ ("DMTPRECLR") __attribute__((section("sfrs"), address(0xBF800A10)));
#define DMTCLR DMTCLR
extern volatile uint32_t   DMTCLR __attribute__((section("sfrs"), address(0xBF800A20)));
typedef struct {
  uint32_t STEP2:8;
} __DMTCLRbits_t;
extern volatile __DMTCLRbits_t DMTCLRbits __asm__ ("DMTCLR") __attribute__((section("sfrs"), address(0xBF800A20)));
#define DMTSTAT DMTSTAT
extern volatile uint32_t   DMTSTAT __attribute__((section("sfrs"), address(0xBF800A30)));
typedef union {
  struct {
    uint32_t WINOPN:1;
    uint32_t :4;
    uint32_t DMTEVENT:1;
    uint32_t BAD:2;
  };
  struct {
    uint32_t :6;
    uint32_t BAD2:1;
    uint32_t BAD1:1;
  };
  struct {
    uint32_t w:32;
  };
} __DMTSTATbits_t;
extern volatile __DMTSTATbits_t DMTSTATbits __asm__ ("DMTSTAT") __attribute__((section("sfrs"), address(0xBF800A30)));
#define DMTCNT DMTCNT
extern volatile uint32_t   DMTCNT __attribute__((section("sfrs"), address(0xBF800A40)));
typedef struct {
  uint32_t COUNTER:32;
} __DMTCNTbits_t;
extern volatile __DMTCNTbits_t DMTCNTbits __asm__ ("DMTCNT") __attribute__((section("sfrs"), address(0xBF800A40)));
#define DMTPSCNT DMTPSCNT
extern volatile uint32_t   DMTPSCNT __attribute__((section("sfrs"), address(0xBF800A60)));
typedef struct {
  uint32_t PSCNT:32;
} __DMTPSCNTbits_t;
extern volatile __DMTPSCNTbits_t DMTPSCNTbits __asm__ ("DMTPSCNT") __attribute__((section("sfrs"), address(0xBF800A60)));
#define DMTPSINTV DMTPSINTV
extern volatile uint32_t   DMTPSINTV __attribute__((section("sfrs"), address(0xBF800A70)));
typedef struct {
  uint32_t PSINTV:32;
} __DMTPSINTVbits_t;
extern volatile __DMTPSINTVbits_t DMTPSINTVbits __asm__ ("DMTPSINTV") __attribute__((section("sfrs"), address(0xBF800A70)));
#define RTCCON RTCCON
extern volatile uint32_t   RTCCON __attribute__((section("sfrs"), address(0xBF800C00)));
typedef union {
  struct {
    uint32_t RTCOE:1;
    uint32_t HALFSEC:1;
    uint32_t RTCSYNC:1;
    uint32_t RTCWREN:1;
    uint32_t :2;
    uint32_t RTCCLKON:1;
    uint32_t RTCOUTSEL:2;
    uint32_t RTCCLKSEL:2;
    uint32_t :2;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t CAL:10;
  };
  struct {
    uint32_t w:32;
  };
} __RTCCONbits_t;
extern volatile __RTCCONbits_t RTCCONbits __asm__ ("RTCCON") __attribute__((section("sfrs"), address(0xBF800C00)));
extern volatile uint32_t        RTCCONCLR __attribute__((section("sfrs"),address(0xBF800C04)));
extern volatile uint32_t        RTCCONSET __attribute__((section("sfrs"),address(0xBF800C08)));
extern volatile uint32_t        RTCCONINV __attribute__((section("sfrs"),address(0xBF800C0C)));
#define RTCALRM RTCALRM
extern volatile uint32_t   RTCALRM __attribute__((section("sfrs"), address(0xBF800C10)));
typedef union {
  struct {
    uint32_t ARPT:8;
    uint32_t AMASK:4;
    uint32_t ALRMSYNC:1;
    uint32_t PIV:1;
    uint32_t CHIME:1;
    uint32_t ALRMEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __RTCALRMbits_t;
extern volatile __RTCALRMbits_t RTCALRMbits __asm__ ("RTCALRM") __attribute__((section("sfrs"), address(0xBF800C10)));
extern volatile uint32_t        RTCALRMCLR __attribute__((section("sfrs"),address(0xBF800C14)));
extern volatile uint32_t        RTCALRMSET __attribute__((section("sfrs"),address(0xBF800C18)));
extern volatile uint32_t        RTCALRMINV __attribute__((section("sfrs"),address(0xBF800C1C)));
#define RTCTIME RTCTIME
extern volatile uint32_t   RTCTIME __attribute__((section("sfrs"), address(0xBF800C20)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t SEC01:4;
    uint32_t SEC10:4;
    uint32_t MIN01:4;
    uint32_t MIN10:4;
    uint32_t HR01:4;
    uint32_t HR10:4;
  };
  struct {
    uint32_t w:32;
  };
} __RTCTIMEbits_t;
extern volatile __RTCTIMEbits_t RTCTIMEbits __asm__ ("RTCTIME") __attribute__((section("sfrs"), address(0xBF800C20)));
extern volatile uint32_t        RTCTIMECLR __attribute__((section("sfrs"),address(0xBF800C24)));
extern volatile uint32_t        RTCTIMESET __attribute__((section("sfrs"),address(0xBF800C28)));
extern volatile uint32_t        RTCTIMEINV __attribute__((section("sfrs"),address(0xBF800C2C)));
#define RTCDATE RTCDATE
extern volatile uint32_t   RTCDATE __attribute__((section("sfrs"), address(0xBF800C30)));
typedef union {
  struct {
    uint32_t WDAY01:4;
    uint32_t :4;
    uint32_t DAY01:4;
    uint32_t DAY10:4;
    uint32_t MONTH01:4;
    uint32_t MONTH10:4;
    uint32_t YEAR01:4;
    uint32_t YEAR10:4;
  };
  struct {
    uint32_t w:32;
  };
} __RTCDATEbits_t;
extern volatile __RTCDATEbits_t RTCDATEbits __asm__ ("RTCDATE") __attribute__((section("sfrs"), address(0xBF800C30)));
extern volatile uint32_t        RTCDATECLR __attribute__((section("sfrs"),address(0xBF800C34)));
extern volatile uint32_t        RTCDATESET __attribute__((section("sfrs"),address(0xBF800C38)));
extern volatile uint32_t        RTCDATEINV __attribute__((section("sfrs"),address(0xBF800C3C)));
#define ALRMTIME ALRMTIME
extern volatile uint32_t   ALRMTIME __attribute__((section("sfrs"), address(0xBF800C40)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t SEC01:4;
    uint32_t SEC10:4;
    uint32_t MIN01:4;
    uint32_t MIN10:4;
    uint32_t HR01:4;
    uint32_t HR10:4;
  };
  struct {
    uint32_t w:32;
  };
} __ALRMTIMEbits_t;
