MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECH064/mcu.h
extern volatile __AD1TRG3bits_t AD1TRG3bits __asm__ ("AD1TRG3") __attribute__((section("sfrs"), address(0xBF84B078)));
#define AD1CMPCON1 AD1CMPCON1
extern volatile uint32_t   AD1CMPCON1 __attribute__((section("sfrs"), address(0xBF84B090)));
typedef struct {
  uint32_t IELOLO:1;
  uint32_t IELOHI:1;
  uint32_t IEHILO:1;
  uint32_t IEHIHI:1;
  uint32_t IEBTWN:1;
  uint32_t DCMPED:1;
  uint32_t DCMPGIEN:1;
  uint32_t ENDCMP:1;
  uint32_t AINID:5;
} __AD1CMPCON1bits_t;
extern volatile __AD1CMPCON1bits_t AD1CMPCON1bits __asm__ ("AD1CMPCON1") __attribute__((section("sfrs"), address(0xBF84B090)));
#define AD1CMPCON2 AD1CMPCON2
extern volatile uint32_t   AD1CMPCON2 __attribute__((section("sfrs"), address(0xBF84B094)));
typedef struct {
  uint32_t IELOLO:1;
  uint32_t IELOHI:1;
  uint32_t IEHILO:1;
  uint32_t IEHIHI:1;
  uint32_t IEBTWN:1;
  uint32_t DCMPED:1;
  uint32_t DCMPGIEN:1;
  uint32_t ENDCMP:1;
  uint32_t AINID:5;
} __AD1CMPCON2bits_t;
extern volatile __AD1CMPCON2bits_t AD1CMPCON2bits __asm__ ("AD1CMPCON2") __attribute__((section("sfrs"), address(0xBF84B094)));
#define AD1CMPCON3 AD1CMPCON3
extern volatile uint32_t   AD1CMPCON3 __attribute__((section("sfrs"), address(0xBF84B098)));
typedef struct {
  uint32_t IELOLO:1;
  uint32_t IELOHI:1;
  uint32_t IEHILO:1;
  uint32_t IEHIHI:1;
  uint32_t IEBTWN:1;
  uint32_t DCMPED:1;
  uint32_t DCMPGIEN:1;
  uint32_t ENDCMP:1;
  uint32_t AINID:5;
} __AD1CMPCON3bits_t;
extern volatile __AD1CMPCON3bits_t AD1CMPCON3bits __asm__ ("AD1CMPCON3") __attribute__((section("sfrs"), address(0xBF84B098)));
#define AD1CMPCON4 AD1CMPCON4
extern volatile uint32_t   AD1CMPCON4 __attribute__((section("sfrs"), address(0xBF84B09C)));
typedef struct {
  uint32_t IELOLO:1;
  uint32_t IELOHI:1;
  uint32_t IEHILO:1;
  uint32_t IEHIHI:1;
  uint32_t IEBTWN:1;
  uint32_t DCMPED:1;
  uint32_t DCMPGIEN:1;
  uint32_t ENDCMP:1;
  uint32_t AINID:5;
} __AD1CMPCON4bits_t;
extern volatile __AD1CMPCON4bits_t AD1CMPCON4bits __asm__ ("AD1CMPCON4") __attribute__((section("sfrs"), address(0xBF84B09C)));
#define AD1CMPCON5 AD1CMPCON5
extern volatile uint32_t   AD1CMPCON5 __attribute__((section("sfrs"), address(0xBF84B0A0)));
typedef struct {
  uint32_t IELOLO:1;
  uint32_t IELOHI:1;
  uint32_t IEHILO:1;
  uint32_t IEHIHI:1;
  uint32_t IEBTWN:1;
  uint32_t DCMPED:1;
  uint32_t DCMPGIEN:1;
  uint32_t ENDCMP:1;
  uint32_t AINID:5;
} __AD1CMPCON5bits_t;
extern volatile __AD1CMPCON5bits_t AD1CMPCON5bits __asm__ ("AD1CMPCON5") __attribute__((section("sfrs"), address(0xBF84B0A0)));
#define AD1CMPCON6 AD1CMPCON6
extern volatile uint32_t   AD1CMPCON6 __attribute__((section("sfrs"), address(0xBF84B0A4)));
typedef struct {
  uint32_t IELOLO:1;
  uint32_t IELOHI:1;
  uint32_t IEHILO:1;
  uint32_t IEHIHI:1;
  uint32_t IEBTWN:1;
  uint32_t DCMPED:1;
  uint32_t DCMPGIEN:1;
  uint32_t ENDCMP:1;
  uint32_t AINID:5;
} __AD1CMPCON6bits_t;
extern volatile __AD1CMPCON6bits_t AD1CMPCON6bits __asm__ ("AD1CMPCON6") __attribute__((section("sfrs"), address(0xBF84B0A4)));
#define AD1DATA0 AD1DATA0
extern volatile uint32_t   AD1DATA0 __attribute__((section("sfrs"), address(0xBF84B0B8)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA0bits_t;
extern volatile __AD1DATA0bits_t AD1DATA0bits __asm__ ("AD1DATA0") __attribute__((section("sfrs"), address(0xBF84B0B8)));
#define AD1DATA1 AD1DATA1
extern volatile uint32_t   AD1DATA1 __attribute__((section("sfrs"), address(0xBF84B0BC)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA1bits_t;
extern volatile __AD1DATA1bits_t AD1DATA1bits __asm__ ("AD1DATA1") __attribute__((section("sfrs"), address(0xBF84B0BC)));
#define AD1DATA2 AD1DATA2
extern volatile uint32_t   AD1DATA2 __attribute__((section("sfrs"), address(0xBF84B0C0)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA2bits_t;
extern volatile __AD1DATA2bits_t AD1DATA2bits __asm__ ("AD1DATA2") __attribute__((section("sfrs"), address(0xBF84B0C0)));
#define AD1DATA3 AD1DATA3
extern volatile uint32_t   AD1DATA3 __attribute__((section("sfrs"), address(0xBF84B0C4)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA3bits_t;
extern volatile __AD1DATA3bits_t AD1DATA3bits __asm__ ("AD1DATA3") __attribute__((section("sfrs"), address(0xBF84B0C4)));
#define AD1DATA4 AD1DATA4
extern volatile uint32_t   AD1DATA4 __attribute__((section("sfrs"), address(0xBF84B0C8)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA4bits_t;
extern volatile __AD1DATA4bits_t AD1DATA4bits __asm__ ("AD1DATA4") __attribute__((section("sfrs"), address(0xBF84B0C8)));
#define AD1DATA5 AD1DATA5
extern volatile uint32_t   AD1DATA5 __attribute__((section("sfrs"), address(0xBF84B0CC)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA5bits_t;
extern volatile __AD1DATA5bits_t AD1DATA5bits __asm__ ("AD1DATA5") __attribute__((section("sfrs"), address(0xBF84B0CC)));
#define AD1DATA6 AD1DATA6
extern volatile uint32_t   AD1DATA6 __attribute__((section("sfrs"), address(0xBF84B0D0)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA6bits_t;
extern volatile __AD1DATA6bits_t AD1DATA6bits __asm__ ("AD1DATA6") __attribute__((section("sfrs"), address(0xBF84B0D0)));
#define AD1DATA7 AD1DATA7
extern volatile uint32_t   AD1DATA7 __attribute__((section("sfrs"), address(0xBF84B0D4)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA7bits_t;
extern volatile __AD1DATA7bits_t AD1DATA7bits __asm__ ("AD1DATA7") __attribute__((section("sfrs"), address(0xBF84B0D4)));
#define AD1DATA8 AD1DATA8
extern volatile uint32_t   AD1DATA8 __attribute__((section("sfrs"), address(0xBF84B0D8)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA8bits_t;
extern volatile __AD1DATA8bits_t AD1DATA8bits __asm__ ("AD1DATA8") __attribute__((section("sfrs"), address(0xBF84B0D8)));
#define AD1DATA9 AD1DATA9
extern volatile uint32_t   AD1DATA9 __attribute__((section("sfrs"), address(0xBF84B0DC)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA9bits_t;
extern volatile __AD1DATA9bits_t AD1DATA9bits __asm__ ("AD1DATA9") __attribute__((section("sfrs"), address(0xBF84B0DC)));
#define AD1DATA10 AD1DATA10
extern volatile uint32_t   AD1DATA10 __attribute__((section("sfrs"), address(0xBF84B0E0)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA10bits_t;
extern volatile __AD1DATA10bits_t AD1DATA10bits __asm__ ("AD1DATA10") __attribute__((section("sfrs"), address(0xBF84B0E0)));
#define AD1DATA11 AD1DATA11
extern volatile uint32_t   AD1DATA11 __attribute__((section("sfrs"), address(0xBF84B0E4)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA11bits_t;
extern volatile __AD1DATA11bits_t AD1DATA11bits __asm__ ("AD1DATA11") __attribute__((section("sfrs"), address(0xBF84B0E4)));
#define AD1DATA12 AD1DATA12
extern volatile uint32_t   AD1DATA12 __attribute__((section("sfrs"), address(0xBF84B0E8)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA12bits_t;
extern volatile __AD1DATA12bits_t AD1DATA12bits __asm__ ("AD1DATA12") __attribute__((section("sfrs"), address(0xBF84B0E8)));
#define AD1DATA13 AD1DATA13
extern volatile uint32_t   AD1DATA13 __attribute__((section("sfrs"), address(0xBF84B0EC)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA13bits_t;
extern volatile __AD1DATA13bits_t AD1DATA13bits __asm__ ("AD1DATA13") __attribute__((section("sfrs"), address(0xBF84B0EC)));
#define AD1DATA14 AD1DATA14
extern volatile uint32_t   AD1DATA14 __attribute__((section("sfrs"), address(0xBF84B0F0)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA14bits_t;
extern volatile __AD1DATA14bits_t AD1DATA14bits __asm__ ("AD1DATA14") __attribute__((section("sfrs"), address(0xBF84B0F0)));
#define AD1DATA15 AD1DATA15
extern volatile uint32_t   AD1DATA15 __attribute__((section("sfrs"), address(0xBF84B0F4)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA15bits_t;
extern volatile __AD1DATA15bits_t AD1DATA15bits __asm__ ("AD1DATA15") __attribute__((section("sfrs"), address(0xBF84B0F4)));
#define AD1DATA16 AD1DATA16
extern volatile uint32_t   AD1DATA16 __attribute__((section("sfrs"), address(0xBF84B0F8)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA16bits_t;
extern volatile __AD1DATA16bits_t AD1DATA16bits __asm__ ("AD1DATA16") __attribute__((section("sfrs"), address(0xBF84B0F8)));
#define AD1DATA17 AD1DATA17
extern volatile uint32_t   AD1DATA17 __attribute__((section("sfrs"), address(0xBF84B0FC)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA17bits_t;
extern volatile __AD1DATA17bits_t AD1DATA17bits __asm__ ("AD1DATA17") __attribute__((section("sfrs"), address(0xBF84B0FC)));
#define AD1DATA18 AD1DATA18
extern volatile uint32_t   AD1DATA18 __attribute__((section("sfrs"), address(0xBF84B100)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA18bits_t;
extern volatile __AD1DATA18bits_t AD1DATA18bits __asm__ ("AD1DATA18") __attribute__((section("sfrs"), address(0xBF84B100)));
#define AD1DATA43 AD1DATA43
extern volatile uint32_t   AD1DATA43 __attribute__((section("sfrs"), address(0xBF84B164)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA43bits_t;
