MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECH064/mcu.h
extern volatile __USBE7CSR3bits_t USBE7CSR3bits __asm__ ("USBE7CSR3") __attribute__((section("sfrs"), address(0xBF8E317C)));
#define USBDMAINT USBDMAINT
extern volatile uint32_t   USBDMAINT __attribute__((section("sfrs"), address(0xBF8E3200)));
typedef struct {
  uint32_t DMA1IF:1;
  uint32_t DMA2IF:1;
  uint32_t DMA3IF:1;
  uint32_t DMA4IF:1;
  uint32_t DMA5IF:1;
  uint32_t DMA6IF:1;
  uint32_t DMA7IF:1;
  uint32_t DMA8IF:1;
} __USBDMAINTbits_t;
extern volatile __USBDMAINTbits_t USBDMAINTbits __asm__ ("USBDMAINT") __attribute__((section("sfrs"), address(0xBF8E3200)));
#define USBDMA1C USBDMA1C
extern volatile uint32_t   USBDMA1C __attribute__((section("sfrs"), address(0xBF8E3204)));
typedef struct {
  uint32_t DMAEN:1;
  uint32_t DMADIR:1;
  uint32_t DMAMODE:1;
  uint32_t DMAIE:1;
  uint32_t DMAEP:4;
  uint32_t DMAERR:1;
  uint32_t DMABRSTM:2;
} __USBDMA1Cbits_t;
extern volatile __USBDMA1Cbits_t USBDMA1Cbits __asm__ ("USBDMA1C") __attribute__((section("sfrs"), address(0xBF8E3204)));
#define USBDMA1A USBDMA1A
extern volatile uint32_t   USBDMA1A __attribute__((section("sfrs"), address(0xBF8E3208)));
typedef struct {
  uint32_t DMAADDR:32;
} __USBDMA1Abits_t;
extern volatile __USBDMA1Abits_t USBDMA1Abits __asm__ ("USBDMA1A") __attribute__((section("sfrs"), address(0xBF8E3208)));
#define USBDMA1N USBDMA1N
extern volatile uint32_t   USBDMA1N __attribute__((section("sfrs"), address(0xBF8E320C)));
typedef struct {
  uint32_t DMACOUNT:32;
} __USBDMA1Nbits_t;
extern volatile __USBDMA1Nbits_t USBDMA1Nbits __asm__ ("USBDMA1N") __attribute__((section("sfrs"), address(0xBF8E320C)));
#define USBDMA2C USBDMA2C
extern volatile uint32_t   USBDMA2C __attribute__((section("sfrs"), address(0xBF8E3214)));
typedef struct {
  uint32_t DMAEN:1;
  uint32_t DMADIR:1;
  uint32_t DMAMODE:1;
  uint32_t DMAIE:1;
  uint32_t DMAEP:4;
  uint32_t DMAERR:1;
  uint32_t DMABRSTM:2;
} __USBDMA2Cbits_t;
extern volatile __USBDMA2Cbits_t USBDMA2Cbits __asm__ ("USBDMA2C") __attribute__((section("sfrs"), address(0xBF8E3214)));
#define USBDMA2A USBDMA2A
extern volatile uint32_t   USBDMA2A __attribute__((section("sfrs"), address(0xBF8E3218)));
typedef struct {
  uint32_t DMAADDR:32;
} __USBDMA2Abits_t;
extern volatile __USBDMA2Abits_t USBDMA2Abits __asm__ ("USBDMA2A") __attribute__((section("sfrs"), address(0xBF8E3218)));
#define USBDMA2N USBDMA2N
extern volatile uint32_t   USBDMA2N __attribute__((section("sfrs"), address(0xBF8E321C)));
typedef struct {
  uint32_t DMACOUNT:32;
} __USBDMA2Nbits_t;
extern volatile __USBDMA2Nbits_t USBDMA2Nbits __asm__ ("USBDMA2N") __attribute__((section("sfrs"), address(0xBF8E321C)));
#define USBDMA3C USBDMA3C
extern volatile uint32_t   USBDMA3C __attribute__((section("sfrs"), address(0xBF8E3224)));
typedef struct {
  uint32_t DMAEN:1;
  uint32_t DMADIR:1;
  uint32_t DMAMODE:1;
  uint32_t DMAIE:1;
  uint32_t DMAEP:4;
  uint32_t DMAERR:1;
  uint32_t DMABRSTM:2;
} __USBDMA3Cbits_t;
extern volatile __USBDMA3Cbits_t USBDMA3Cbits __asm__ ("USBDMA3C") __attribute__((section("sfrs"), address(0xBF8E3224)));
#define USBDMA3A USBDMA3A
extern volatile uint32_t   USBDMA3A __attribute__((section("sfrs"), address(0xBF8E3228)));
typedef struct {
  uint32_t DMAADDR:32;
} __USBDMA3Abits_t;
extern volatile __USBDMA3Abits_t USBDMA3Abits __asm__ ("USBDMA3A") __attribute__((section("sfrs"), address(0xBF8E3228)));
#define USBDMA3N USBDMA3N
extern volatile uint32_t   USBDMA3N __attribute__((section("sfrs"), address(0xBF8E322C)));
typedef struct {
  uint32_t DMACOUNT:32;
} __USBDMA3Nbits_t;
extern volatile __USBDMA3Nbits_t USBDMA3Nbits __asm__ ("USBDMA3N") __attribute__((section("sfrs"), address(0xBF8E322C)));
#define USBDMA4C USBDMA4C
extern volatile uint32_t   USBDMA4C __attribute__((section("sfrs"), address(0xBF8E3234)));
typedef struct {
  uint32_t DMAEN:1;
  uint32_t DMADIR:1;
  uint32_t DMAMODE:1;
  uint32_t DMAIE:1;
  uint32_t DMAEP:4;
  uint32_t DMAERR:1;
  uint32_t DMABRSTM:2;
} __USBDMA4Cbits_t;
extern volatile __USBDMA4Cbits_t USBDMA4Cbits __asm__ ("USBDMA4C") __attribute__((section("sfrs"), address(0xBF8E3234)));
#define USBDMA4A USBDMA4A
extern volatile uint32_t   USBDMA4A __attribute__((section("sfrs"), address(0xBF8E3238)));
typedef struct {
  uint32_t DMAADDR:32;
} __USBDMA4Abits_t;
extern volatile __USBDMA4Abits_t USBDMA4Abits __asm__ ("USBDMA4A") __attribute__((section("sfrs"), address(0xBF8E3238)));
#define USBDMA4N USBDMA4N
extern volatile uint32_t   USBDMA4N __attribute__((section("sfrs"), address(0xBF8E323C)));
typedef struct {
  uint32_t DMACOUNT:32;
} __USBDMA4Nbits_t;
extern volatile __USBDMA4Nbits_t USBDMA4Nbits __asm__ ("USBDMA4N") __attribute__((section("sfrs"), address(0xBF8E323C)));
#define USBDMA5C USBDMA5C
extern volatile uint32_t   USBDMA5C __attribute__((section("sfrs"), address(0xBF8E3244)));
typedef struct {
  uint32_t DMAEN:1;
  uint32_t DMADIR:1;
  uint32_t DMAMODE:1;
  uint32_t DMAIE:1;
  uint32_t DMAEP:4;
  uint32_t DMAERR:1;
  uint32_t DMABRSTM:2;
} __USBDMA5Cbits_t;
extern volatile __USBDMA5Cbits_t USBDMA5Cbits __asm__ ("USBDMA5C") __attribute__((section("sfrs"), address(0xBF8E3244)));
#define USBDMA5A USBDMA5A
extern volatile uint32_t   USBDMA5A __attribute__((section("sfrs"), address(0xBF8E3248)));
typedef struct {
  uint32_t DMAADDR:32;
} __USBDMA5Abits_t;
extern volatile __USBDMA5Abits_t USBDMA5Abits __asm__ ("USBDMA5A") __attribute__((section("sfrs"), address(0xBF8E3248)));
#define USBDMA5N USBDMA5N
extern volatile uint32_t   USBDMA5N __attribute__((section("sfrs"), address(0xBF8E324C)));
typedef struct {
  uint32_t DMACOUNT:32;
} __USBDMA5Nbits_t;
extern volatile __USBDMA5Nbits_t USBDMA5Nbits __asm__ ("USBDMA5N") __attribute__((section("sfrs"), address(0xBF8E324C)));
#define USBDMA6C USBDMA6C
extern volatile uint32_t   USBDMA6C __attribute__((section("sfrs"), address(0xBF8E3254)));
typedef struct {
  uint32_t DMAEN:1;
  uint32_t DMADIR:1;
  uint32_t DMAMODE:1;
  uint32_t DMAIE:1;
  uint32_t DMAEP:4;
  uint32_t DMAERR:1;
  uint32_t DMABRSTM:2;
} __USBDMA6Cbits_t;
extern volatile __USBDMA6Cbits_t USBDMA6Cbits __asm__ ("USBDMA6C") __attribute__((section("sfrs"), address(0xBF8E3254)));
#define USBDMA6A USBDMA6A
extern volatile uint32_t   USBDMA6A __attribute__((section("sfrs"), address(0xBF8E3258)));
typedef struct {
  uint32_t DMAADDR:32;
} __USBDMA6Abits_t;
