MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECH064/mcu.h
#define _IPC8_IC7IS_POSITION                     0x00000010
#define _IPC8_IC7IS_MASK                         0x00030000
#define _IPC8_IC7IS_LENGTH                       0x00000002

#define _IPC8_IC7IP_POSITION                     0x00000012
#define _IPC8_IC7IP_MASK                         0x001C0000
#define _IPC8_IC7IP_LENGTH                       0x00000003

#define _IPC8_OC7IS_POSITION                     0x00000018
#define _IPC8_OC7IS_MASK                         0x03000000
#define _IPC8_OC7IS_LENGTH                       0x00000002

#define _IPC8_OC7IP_POSITION                     0x0000001A
#define _IPC8_OC7IP_MASK                         0x1C000000
#define _IPC8_OC7IP_LENGTH                       0x00000003

#define _IPC8_w_POSITION                         0x00000000
#define _IPC8_w_MASK                             0xFFFFFFFF
#define _IPC8_w_LENGTH                           0x00000020

#define _IPC9_T8IS_POSITION                      0x00000000
#define _IPC9_T8IS_MASK                          0x00000003
#define _IPC9_T8IS_LENGTH                        0x00000002

#define _IPC9_T8IP_POSITION                      0x00000002
#define _IPC9_T8IP_MASK                          0x0000001C
#define _IPC9_T8IP_LENGTH                        0x00000003

#define _IPC9_IC8EIS_POSITION                    0x00000008
#define _IPC9_IC8EIS_MASK                        0x00000300
#define _IPC9_IC8EIS_LENGTH                      0x00000002

#define _IPC9_IC8EIP_POSITION                    0x0000000A
#define _IPC9_IC8EIP_MASK                        0x00001C00
#define _IPC9_IC8EIP_LENGTH                      0x00000003

#define _IPC9_IC8IS_POSITION                     0x00000010
#define _IPC9_IC8IS_MASK                         0x00030000
#define _IPC9_IC8IS_LENGTH                       0x00000002

#define _IPC9_IC8IP_POSITION                     0x00000012
#define _IPC9_IC8IP_MASK                         0x001C0000
#define _IPC9_IC8IP_LENGTH                       0x00000003

#define _IPC9_OC8IS_POSITION                     0x00000018
#define _IPC9_OC8IS_MASK                         0x03000000
#define _IPC9_OC8IS_LENGTH                       0x00000002

#define _IPC9_OC8IP_POSITION                     0x0000001A
#define _IPC9_OC8IP_MASK                         0x1C000000
#define _IPC9_OC8IP_LENGTH                       0x00000003

#define _IPC9_w_POSITION                         0x00000000
#define _IPC9_w_MASK                             0xFFFFFFFF
#define _IPC9_w_LENGTH                           0x00000020

#define _IPC10_T9IS_POSITION                     0x00000000
#define _IPC10_T9IS_MASK                         0x00000003
#define _IPC10_T9IS_LENGTH                       0x00000002

#define _IPC10_T9IP_POSITION                     0x00000002
#define _IPC10_T9IP_MASK                         0x0000001C
#define _IPC10_T9IP_LENGTH                       0x00000003

#define _IPC10_IC9EIS_POSITION                   0x00000008
#define _IPC10_IC9EIS_MASK                       0x00000300
#define _IPC10_IC9EIS_LENGTH                     0x00000002

#define _IPC10_IC9EIP_POSITION                   0x0000000A
#define _IPC10_IC9EIP_MASK                       0x00001C00
#define _IPC10_IC9EIP_LENGTH                     0x00000003

#define _IPC10_IC9IS_POSITION                    0x00000010
#define _IPC10_IC9IS_MASK                        0x00030000
#define _IPC10_IC9IS_LENGTH                      0x00000002

#define _IPC10_IC9IP_POSITION                    0x00000012
#define _IPC10_IC9IP_MASK                        0x001C0000
#define _IPC10_IC9IP_LENGTH                      0x00000003

#define _IPC10_OC9IS_POSITION                    0x00000018
#define _IPC10_OC9IS_MASK                        0x03000000
#define _IPC10_OC9IS_LENGTH                      0x00000002

#define _IPC10_OC9IP_POSITION                    0x0000001A
#define _IPC10_OC9IP_MASK                        0x1C000000
#define _IPC10_OC9IP_LENGTH                      0x00000003

#define _IPC10_w_POSITION                        0x00000000
#define _IPC10_w_MASK                            0xFFFFFFFF
#define _IPC10_w_LENGTH                          0x00000020

#define _IPC11_AD1IS_POSITION                    0x00000000
#define _IPC11_AD1IS_MASK                        0x00000003
#define _IPC11_AD1IS_LENGTH                      0x00000002

#define _IPC11_AD1IP_POSITION                    0x00000002
#define _IPC11_AD1IP_MASK                        0x0000001C
#define _IPC11_AD1IP_LENGTH                      0x00000003

#define _IPC11_AD1DC1IS_POSITION                 0x00000010
#define _IPC11_AD1DC1IS_MASK                     0x00030000
#define _IPC11_AD1DC1IS_LENGTH                   0x00000002

#define _IPC11_AD1DC1IP_POSITION                 0x00000012
#define _IPC11_AD1DC1IP_MASK                     0x001C0000
#define _IPC11_AD1DC1IP_LENGTH                   0x00000003

#define _IPC11_AD1DC2IS_POSITION                 0x00000018
#define _IPC11_AD1DC2IS_MASK                     0x03000000
#define _IPC11_AD1DC2IS_LENGTH                   0x00000002

#define _IPC11_AD1DC2IP_POSITION                 0x0000001A
#define _IPC11_AD1DC2IP_MASK                     0x1C000000
#define _IPC11_AD1DC2IP_LENGTH                   0x00000003

#define _IPC11_w_POSITION                        0x00000000
#define _IPC11_w_MASK                            0xFFFFFFFF
#define _IPC11_w_LENGTH                          0x00000020

#define _IPC12_AD1DC3IS_POSITION                 0x00000000
#define _IPC12_AD1DC3IS_MASK                     0x00000003
#define _IPC12_AD1DC3IS_LENGTH                   0x00000002

#define _IPC12_AD1DC3IP_POSITION                 0x00000002
#define _IPC12_AD1DC3IP_MASK                     0x0000001C
#define _IPC12_AD1DC3IP_LENGTH                   0x00000003

#define _IPC12_AD1DC4IS_POSITION                 0x00000008
#define _IPC12_AD1DC4IS_MASK                     0x00000300
#define _IPC12_AD1DC4IS_LENGTH                   0x00000002

#define _IPC12_AD1DC4IP_POSITION                 0x0000000A
#define _IPC12_AD1DC4IP_MASK                     0x00001C00
#define _IPC12_AD1DC4IP_LENGTH                   0x00000003

#define _IPC12_AD1DC5IS_POSITION                 0x00000010
#define _IPC12_AD1DC5IS_MASK                     0x00030000
#define _IPC12_AD1DC5IS_LENGTH                   0x00000002

#define _IPC12_AD1DC5IP_POSITION                 0x00000012
#define _IPC12_AD1DC5IP_MASK                     0x001C0000
#define _IPC12_AD1DC5IP_LENGTH                   0x00000003

#define _IPC12_AD1DC6IS_POSITION                 0x00000018
#define _IPC12_AD1DC6IS_MASK                     0x03000000
#define _IPC12_AD1DC6IS_LENGTH                   0x00000002

#define _IPC12_AD1DC6IP_POSITION                 0x0000001A
#define _IPC12_AD1DC6IP_MASK                     0x1C000000
#define _IPC12_AD1DC6IP_LENGTH                   0x00000003

