MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECH064/mcu.h
#define _AD1CMPEN2_CMPE5_POSITION                0x00000005
#define _AD1CMPEN2_CMPE5_MASK                    0x00000020
#define _AD1CMPEN2_CMPE5_LENGTH                  0x00000001

#define _AD1CMPEN2_CMPE6_POSITION                0x00000006
#define _AD1CMPEN2_CMPE6_MASK                    0x00000040
#define _AD1CMPEN2_CMPE6_LENGTH                  0x00000001

#define _AD1CMPEN2_CMPE7_POSITION                0x00000007
#define _AD1CMPEN2_CMPE7_MASK                    0x00000080
#define _AD1CMPEN2_CMPE7_LENGTH                  0x00000001

#define _AD1CMPEN2_CMPE8_POSITION                0x00000008
#define _AD1CMPEN2_CMPE8_MASK                    0x00000100
#define _AD1CMPEN2_CMPE8_LENGTH                  0x00000001

#define _AD1CMPEN2_CMPE9_POSITION                0x00000009
#define _AD1CMPEN2_CMPE9_MASK                    0x00000200
#define _AD1CMPEN2_CMPE9_LENGTH                  0x00000001

#define _AD1CMPEN2_CMPE10_POSITION               0x0000000A
#define _AD1CMPEN2_CMPE10_MASK                   0x00000400
#define _AD1CMPEN2_CMPE10_LENGTH                 0x00000001

#define _AD1CMPEN2_CMPE11_POSITION               0x0000000B
#define _AD1CMPEN2_CMPE11_MASK                   0x00000800
#define _AD1CMPEN2_CMPE11_LENGTH                 0x00000001

#define _AD1CMPEN2_CMPE12_POSITION               0x0000000C
#define _AD1CMPEN2_CMPE12_MASK                   0x00001000
#define _AD1CMPEN2_CMPE12_LENGTH                 0x00000001

#define _AD1CMPEN2_CMPE13_POSITION               0x0000000D
#define _AD1CMPEN2_CMPE13_MASK                   0x00002000
#define _AD1CMPEN2_CMPE13_LENGTH                 0x00000001

#define _AD1CMPEN2_CMPE14_POSITION               0x0000000E
#define _AD1CMPEN2_CMPE14_MASK                   0x00004000
#define _AD1CMPEN2_CMPE14_LENGTH                 0x00000001

#define _AD1CMPEN2_CMPE15_POSITION               0x0000000F
#define _AD1CMPEN2_CMPE15_MASK                   0x00008000
#define _AD1CMPEN2_CMPE15_LENGTH                 0x00000001

#define _AD1CMPEN2_CMPE16_POSITION               0x00000010
#define _AD1CMPEN2_CMPE16_MASK                   0x00010000
#define _AD1CMPEN2_CMPE16_LENGTH                 0x00000001

#define _AD1CMPEN2_CMPE17_POSITION               0x00000011
#define _AD1CMPEN2_CMPE17_MASK                   0x00020000
#define _AD1CMPEN2_CMPE17_LENGTH                 0x00000001

#define _AD1CMPEN2_CMPE18_POSITION               0x00000012
#define _AD1CMPEN2_CMPE18_MASK                   0x00040000
#define _AD1CMPEN2_CMPE18_LENGTH                 0x00000001

#define _AD1CMP2_ADCMPLO_POSITION                0x00000000
#define _AD1CMP2_ADCMPLO_MASK                    0x0000FFFF
#define _AD1CMP2_ADCMPLO_LENGTH                  0x00000010

#define _AD1CMP2_ADCMPHI_POSITION                0x00000010
#define _AD1CMP2_ADCMPHI_MASK                    0xFFFF0000
#define _AD1CMP2_ADCMPHI_LENGTH                  0x00000010

#define _AD1CMPEN3_CMPE0_POSITION                0x00000000
#define _AD1CMPEN3_CMPE0_MASK                    0x00000001
#define _AD1CMPEN3_CMPE0_LENGTH                  0x00000001

#define _AD1CMPEN3_CMPE1_POSITION                0x00000001
#define _AD1CMPEN3_CMPE1_MASK                    0x00000002
#define _AD1CMPEN3_CMPE1_LENGTH                  0x00000001

#define _AD1CMPEN3_CMPE2_POSITION                0x00000002
#define _AD1CMPEN3_CMPE2_MASK                    0x00000004
#define _AD1CMPEN3_CMPE2_LENGTH                  0x00000001

#define _AD1CMPEN3_CMPE3_POSITION                0x00000003
#define _AD1CMPEN3_CMPE3_MASK                    0x00000008
#define _AD1CMPEN3_CMPE3_LENGTH                  0x00000001

#define _AD1CMPEN3_CMPE4_POSITION                0x00000004
#define _AD1CMPEN3_CMPE4_MASK                    0x00000010
#define _AD1CMPEN3_CMPE4_LENGTH                  0x00000001

#define _AD1CMPEN3_CMPE5_POSITION                0x00000005
#define _AD1CMPEN3_CMPE5_MASK                    0x00000020
#define _AD1CMPEN3_CMPE5_LENGTH                  0x00000001

#define _AD1CMPEN3_CMPE6_POSITION                0x00000006
#define _AD1CMPEN3_CMPE6_MASK                    0x00000040
#define _AD1CMPEN3_CMPE6_LENGTH                  0x00000001

#define _AD1CMPEN3_CMPE7_POSITION                0x00000007
#define _AD1CMPEN3_CMPE7_MASK                    0x00000080
#define _AD1CMPEN3_CMPE7_LENGTH                  0x00000001

#define _AD1CMPEN3_CMPE8_POSITION                0x00000008
#define _AD1CMPEN3_CMPE8_MASK                    0x00000100
#define _AD1CMPEN3_CMPE8_LENGTH                  0x00000001

#define _AD1CMPEN3_CMPE9_POSITION                0x00000009
#define _AD1CMPEN3_CMPE9_MASK                    0x00000200
#define _AD1CMPEN3_CMPE9_LENGTH                  0x00000001

#define _AD1CMPEN3_CMPE10_POSITION               0x0000000A
#define _AD1CMPEN3_CMPE10_MASK                   0x00000400
#define _AD1CMPEN3_CMPE10_LENGTH                 0x00000001

#define _AD1CMPEN3_CMPE11_POSITION               0x0000000B
#define _AD1CMPEN3_CMPE11_MASK                   0x00000800
#define _AD1CMPEN3_CMPE11_LENGTH                 0x00000001

#define _AD1CMPEN3_CMPE12_POSITION               0x0000000C
#define _AD1CMPEN3_CMPE12_MASK                   0x00001000
#define _AD1CMPEN3_CMPE12_LENGTH                 0x00000001

#define _AD1CMPEN3_CMPE13_POSITION               0x0000000D
#define _AD1CMPEN3_CMPE13_MASK                   0x00002000
#define _AD1CMPEN3_CMPE13_LENGTH                 0x00000001

#define _AD1CMPEN3_CMPE14_POSITION               0x0000000E
#define _AD1CMPEN3_CMPE14_MASK                   0x00004000
#define _AD1CMPEN3_CMPE14_LENGTH                 0x00000001

#define _AD1CMPEN3_CMPE15_POSITION               0x0000000F
#define _AD1CMPEN3_CMPE15_MASK                   0x00008000
#define _AD1CMPEN3_CMPE15_LENGTH                 0x00000001

#define _AD1CMPEN3_CMPE16_POSITION               0x00000010
#define _AD1CMPEN3_CMPE16_MASK                   0x00010000
#define _AD1CMPEN3_CMPE16_LENGTH                 0x00000001

#define _AD1CMPEN3_CMPE17_POSITION               0x00000011
#define _AD1CMPEN3_CMPE17_MASK                   0x00020000
#define _AD1CMPEN3_CMPE17_LENGTH                 0x00000001

#define _AD1CMPEN3_CMPE18_POSITION               0x00000012
#define _AD1CMPEN3_CMPE18_MASK                   0x00040000
#define _AD1CMPEN3_CMPE18_LENGTH                 0x00000001

